# CannotCreateRevealError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateRevealError Property
BuiltInFailures..::..CreationFailures Class See Also
---
Could not create Reveal. [Description]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateRevealError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateRevealError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateRevealError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace